Revit 2027 API
DisplacementElement.GetDisplacedElementIds(View) Method
 Returns the element ids of all displaced elements in the specified view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ICollection<ElementId> GetDisplacedElementIds(
	View view
)
Public Shared Function GetDisplacedElementIds (
	view As View
) As ICollection(Of ElementId)
public:
static ICollection<ElementId^>^ GetDisplacedElementIds(
	View^ view
)
static member GetDisplacedElementIds :
        view : View -> ICollection<ElementId>
Parameters
view View
 The view.
Return Value
ICollection<ElementId>
 The element ids.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DisplacementElement Class
GetDisplacedElementIds Overload
Autodesk.Revit.DB Namespace